In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\python312\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\python312\lib\site-packages (from pandas) (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\koike.atuhiro\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\koike.atuhiro\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.0 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd
students=pd.read_csv("csv/sample.csv")
students

         name language  age
0   kirishima     ruby   15
1    rokumura   python   16
2  midorikawa        c   16

In [4]:
students2=pd.read_csv("csv/sample2.csv")
students2

    kirishima    ruby  15
0    rokumura  python  16
1  midorikawa       c  16

In [6]:
column_names=["students_name","favorite_lang","student_age"]
students2=pd.read_csv("csv/sample2.csv",header=None,names=column_names)
students2

  students_name favorite_lang  student_age
0     kirishima          ruby           15
1      rokumura        python           16
2    midorikawa             c           16

In [7]:
students3=pd.read_csv("csv/sample3.csv")
students3

        name language   age
0  kirishima      NaN  15.0
1   rokumura   python   NaN
2        NaN        c  16.0

In [9]:
nas=["secret",-1]
students4=pd.read_csv("csv/sample4.csv",na_values=nas)
students4

        name language   age
0  kirishima      NaN  15.0
1   rokumura   python   NaN
2        NaN        c  16.0